'''

Напишите программу, которая запрашивает у пользователя пароль. Программа должна продолжать запрашивать пароль,
пока пользователь не введет правильный пароль python123. После этого программа должна вывести сообщение "Пароль верный. Доступ разрешен.". Используйте цикл while.

Sample Input:

test
pwd
python123
test_2

Sample Output:

Пароль верный. Доступ разрешен.

 '''
while input()!="python123":
    pass
print("Пароль верный. Доступ разрешен.")
